# Напишите функцию print_2_add_2, которая будет складывать 2 плюс 2 и печатать этот результат.
# Не забудьте вызвать функцию, чтобы увидеть результат.
def print_2_add_2():
    n = 2 + 2
    print(n)

print_2_add_2()
